# /start

from aiogram import types
from aiogram.filters import Command
from keyboards.constants import main_menu

async def start_command(message: types.Message):
    await message.answer(
        "Привіт! Я ТурБотик — інтелектуальний помічник для підбору турів.\nЯ створений, щоб допомагати "
        "вам знайти актуальні пакетні тури, готелі, страхування,"
        "найвигідніші пропозиції і організувати подорож максимально зручно — прямо тут, в Telegram.\n"
        "Як це працює?\n— Ви вводите бажаний напрямок, дати та бюджет — я шукаю варіанти, які підходять"
        " найкраще.\n— Потім ви можете переглянути опції, вибрати та забронювати тур онлайн.\n— Якщо"
        " хочете персональну допомогу — замовляєте консультацію з менеджером.\nЯ тут, щоб зробити вашу"
        " подорож простішою. Хочете знайти тур саме зараз? Які дати плануєте?",
        reply_markup=main_menu
    )